#+ASSIGNMENT: reflection-1
#+POINTS: 1
#+CATEGORY: participation
#+RUBRIC: (("participation" . 1.0))
#+DUEDATE: <2015-09-09 Wed>

List the two things you are most concerned about for the semester

1. As a novice to programming, how can I develop the ability to combine the knowledge I've already learnt with programming. I mean transferring the traditional way of thinking into code.


2. I am concerning about the habit of thinking and solving problems in paper, like reading, or calculating by hand being a obstacle for me when coding.

List the two most confusing things about today's class

1. What the 0 stands for in the line: print('{0:5s} {1} moles'. format(s,m)). If just a symbol, why can't I replace it?

# (jkitchin): 0 is the index of the argument in the format function.

2. How Python decide a n dimension  vector* another n dimension vector to a number or a n-by-n matrix?

# (jkitchin): * is always element wise multiplication

#+BEGIN_SRC python
import numpy as np

a = np.array([1, 2, 3, 4])

print a * a
print np.dot(a, a)
print np.outer(a, a)
#+END_SRC

#+RESULTS:
: [ 1  4  9 16]
: 30
: [[ 1  2  3  4]
:  [ 2  4  6  8]
:  [ 3  6  9 12]
:  [ 4  8 12 16]]

#+TURNED-IN: Wed Sep  9 10:35:11 2015

* Grade
#+participation: P
#+GRADE: 1.000
#+GRADED-BY: John Kitchin
